{
  "Conference": {
    "column_name": "Conference",
    "examples": [
      "InfoVis",
      "SciVis",
      "Vis",
      "VAST"
    ],
    "unique_value_count": 4,
    "top_frequencies": {
      "Vis": 1942,
      "InfoVis": 886,
      "VAST": 744,
      "SciVis": 305
    }
  },
  "Year": {
    "column_name": "Year",
    "examples": [
      "2011",
      "2014",
      "2010",
      "2006",
      "2007",
      "2009",
      "2016",
      "2012",
      "2013",
      "1991"
    ],
    "unique_value_count": 35,
    "top_frequencies": {
      "2004": 174,
      "2015": 160,
      "2020": 157,
      "2011": 149,
      "2009": 148
    }
  },
  "Title": {
    "column_name": "Title",
    "examples": [
      "D³ Data-Driven Documents",
      "UpSet: Visualization of Intersecting Sets",
      "Narrative Visualization: Telling Stories with Data",
      "Hierarchical Edge Bundles: Visualization of Adjacency Relations in Hierarchical Data",
      "Toward a Deeper Understanding of the Role of Interaction in Information Visualization",
      "A Nested Model for Visualization Design and Validation",
      "Vega-Lite: A Grammar of Interactive Graphics",
      "Design Study Methodology: Reflections from the Trenches and the Stacks",
      "A Multi-Level Typology of Abstract Visualization Tasks",
      "ManyEyes: a Site for Visualization at Internet Scale"
    ],
    "unique_value_count": 3875,
    "top_frequencies": {
      "VAST to Knowledge: Combining tools for exploration and mining": 2,
      "University of British Columbia & Simon Fraser University - The Bricolage": 2,
      "D³ Data-Driven Documents": 1,
      "UpSet: Visualization of Intersecting Sets": 1,
      "Narrative Visualization: Telling Stories with Data": 1
    }
  },
  "DOI": {
    "column_name": "DOI",
    "examples": [
      "10.1109/tvcg.2011.185",
      "10.1109/tvcg.2014.2346248",
      "10.1109/tvcg.2010.179",
      "10.1109/tvcg.2006.147",
      "10.1109/tvcg.2007.70515",
      "10.1109/tvcg.2009.111",
      "10.1109/tvcg.2016.2599030",
      "10.1109/tvcg.2012.213",
      "10.1109/tvcg.2013.124",
      "10.1109/tvcg.2007.70577"
    ],
    "unique_value_count": 3877,
    "top_frequencies": {
      "10.1109/tvcg.2011.185": 1,
      "10.1109/tvcg.2014.2346248": 1,
      "10.1109/tvcg.2010.179": 1,
      "10.1109/tvcg.2006.147": 1,
      "10.1109/tvcg.2007.70515": 1
    }
  },
  "Link": {
    "column_name": "Link",
    "examples": [
      "http://dx.doi.org/10.1109/TVCG.2011.185",
      "http://dx.doi.org/10.1109/TVCG.2014.2346248",
      "http://dx.doi.org/10.1109/TVCG.2010.179",
      "http://dx.doi.org/10.1109/TVCG.2006.147",
      "http://dx.doi.org/10.1109/TVCG.2007.70515",
      "http://dx.doi.org/10.1109/TVCG.2009.111",
      "http://dx.doi.org/10.1109/TVCG.2016.2599030",
      "http://dx.doi.org/10.1109/TVCG.2012.213",
      "http://dx.doi.org/10.1109/TVCG.2013.124",
      "http://dx.doi.org/10.1109/TVCG.2007.70577"
    ],
    "unique_value_count": 3875,
    "top_frequencies": {
      "http://doi.ieeecomputersociety.org/10.1109/VISUAL.2001.964492": 2,
      "http://dx.doi.org/10.1109/VISUAL.1998.745291": 2,
      "http://dx.doi.org/10.1109/TVCG.2011.185": 1,
      "http://dx.doi.org/10.1109/TVCG.2014.2346248": 1,
      "http://dx.doi.org/10.1109/TVCG.2010.179": 1
    }
  },
  "FirstPage": {
    "column_name": "FirstPage",
    "examples": [
      "2301",
      "1983",
      "1139",
      "741",
      "1224",
      "921",
      "341",
      "2431",
      "2376",
      "1121"
    ],
    "unique_value_count": 1589,
    "top_frequencies": {
      "": 51,
      "51": 21,
      "1": 20,
      "11": 20,
      "131": 20
    }
  },
  "LastPage": {
    "column_name": "LastPage",
    "examples": [
      "2309",
      "1992",
      "1148",
      "748",
      "1231",
      "928",
      "350",
      "2440",
      "2385",
      "1128"
    ],
    "unique_value_count": 1615,
    "top_frequencies": {
      "": 266,
      "130": 17,
      "50": 17,
      "42": 16,
      "10": 16
    }
  },
  "PaperType": {
    "column_name": "PaperType",
    "examples": [
      "J",
      "C",
      "M"
    ],
    "unique_value_count": 3,
    "top_frequencies": {
      "J": 1999,
      "C": 1559,
      "M": 319
    }
  },
  "Abstract": {
    "column_name": "Abstract",
    "examples": [
      "Data-Driven Documents (D3) is a novel representation-transparent approach to visualization for the web. Rather than hide the underlying scenegraph within a toolkit-specific abstraction, D3 enables direct inspection and manipulation of a native representation: the standard document object model (DOM). With D3, designers selectively bind input data to arbitrary document elements, applying dynamic transforms to both generate and modify content. We show how representational transparency improves expressiveness and better integrates with developer tools than prior approaches, while offering comparable notational efficiency and retaining powerful declarative components. Immediate evaluation of operators further simplifies debugging and allows iterative development. Additionally, we demonstrate how D3 transforms naturally enable animation and interaction with dramatic performance improvements over intermediate representations.",
      "Understanding relationships between sets is an important analysis task that has received widespread attention in the visualization community. The major challenge in this context is the combinatorial explosion of the number of set intersections if the number of sets exceeds a trivial threshold. In this paper we introduce UpSet, a novel visualization technique for the quantitative analysis of sets, their intersections, and aggregates of intersections. UpSet is focused on creating task-driven aggregates, communicating the size and properties of aggregates and intersections, and a duality between the visualization of the elements in a dataset and their set membership. UpSet visualizes set intersections in a matrix layout and introduces aggregates based on groupings and queries. The matrix layout enables the effective representation of associated data, such as the number of elements in the aggregates and intersections, as well as additional summary statistics derived from subset or element attributes. Sorting according to various measures enables a task-driven analysis of relevant intersections and aggregates. The elements represented in the sets and their associated attributes are visualized in a separate view. Queries based on containment in specific intersections, aggregates or driven by attribute filters are propagated between both views. We also introduce several advanced visual encodings and interaction methods to overcome the problems of varying scales and to address scalability. UpSet is web-based and open source. We demonstrate its general utility in multiple use cases from various domains.",
      "Data visualization is regularly promoted for its ability to reveal stories within data, yet these “data stories” differ in important ways from traditional forms of storytelling. Storytellers, especially online journalists, have increasingly been integrating visualizations into their narratives, in some cases allowing the visualization to function in place of a written story. In this paper, we systematically review the design space of this emerging class of visualizations. Drawing on case studies from news media to visualization research, we identify distinct genres of narrative visualization. We characterize these design differences, together with interactivity and messaging, in terms of the balance between the narrative flow intended by the author (imposed by graphical elements and the interface) and story discovery on the part of the reader (often through interactive exploration). Our framework suggests design strategies for narrative visualization, including promising under-explored approaches to journalistic storytelling and educational media.",
      "A compound graph is a frequently encountered type of data set. Relations are given between items, and a hierarchy is defined on the items as well. We present a new method for visualizing such compound graphs. Our approach is based on visually bundling the adjacency edges, i.e., non-hierarchical edges, together. We realize this as follows. We assume that the hierarchy is shown via a standard tree visualization method. Next, we bend each adjacency edge, modeled as a B-spline curve, toward the polyline defined by the path via the inclusion edges from one node to another. This hierarchical bundling reduces visual clutter and also visualizes implicit adjacency edges between parent nodes that are the result of explicit adjacency edges between their respective child nodes. Furthermore, hierarchical edge bundling is a generic method which can be used in conjunction with existing tree visualization techniques. We illustrate our technique by providing example visualizations and discuss the results based on an informal evaluation provided by potential users of such visualizations",
      "Even though interaction is an important part of information visualization (Infovis), it has garnered a relatively low level of attention from the Infovis community. A few frameworks and taxonomies of Infovis interaction techniques exist, but they typically focus on low-level operations and do not address the variety of benefits interaction provides. After conducting an extensive review of Infovis systems and their interactive capabilities, we propose seven general categories of interaction techniques widely used in Infovis: 1) Select, 2) Explore, 3) Reconfigure, 4) Encode, 5) Abstract/Elaborate, 6) Filter, and 7) Connect. These categories are organized around a user's intent while interacting with a system rather than the low-level interaction techniques provided by a system. The categories can act as a framework to help discuss and evaluate interaction techniques and hopefully lay an initial foundation toward a deeper understanding and a science of interaction.",
      "We present a nested model for the visualization design and validation with four layers: characterize the task and data in the vocabulary of the problem domain, abstract into operations and data types, design visual encoding and interaction techniques, and create algorithms to execute techniques efficiently. The output from a level above is input to the level below, bringing attention to the design challenge that an upstream error inevitably cascades to all downstream levels. This model provides prescriptive guidance for determining appropriate evaluation approaches by identifying threats to validity unique to each level. We also provide three recommendations motivated by this model: authors should distinguish between these levels when claiming contributions at more than one of them, authors should explicitly state upstream assumptions at levels above the focus of a paper, and visualization venues should accept more papers on domain characterization.",
      "We present Vega-Lite, a high-level grammar that enables rapid specification of interactive data visualizations. Vega-Lite combines a traditional grammar of graphics, providing visual encoding rules and a composition algebra for layered and multi-view displays, with a novel grammar of interaction. Users specify interactive semantics by composing selections. In Vega-Lite, a selection is an abstraction that defines input event processing, points of interest, and a predicate function for inclusion testing. Selections parameterize visual encodings by serving as input data, defining scale extents, or by driving conditional logic. The Vega-Lite compiler automatically synthesizes requisite data flow and event handling logic, which users can override for further customization. In contrast to existing reactive specifications, Vega-Lite selections decompose an interaction design into concise, enumerable semantic units. We evaluate Vega-Lite through a range of examples, demonstrating succinct specification of both customized interaction methods and common techniques such as panning, zooming, and linked selection.",
      "Design studies are an increasingly popular form of problem-driven visualization research, yet there is little guidance available about how to do them effectively. In this paper we reflect on our combined experience of conducting twenty-one design studies, as well as reading and reviewing many more, and on an extensive literature review of other field work methods and methodologies. Based on this foundation we provide definitions, propose a methodological framework, and provide practical guidance for conducting design studies. We define a design study as a project in which visualization researchers analyze a specific real-world problem faced by domain experts, design a visualization system that supports solving this problem, validate the design, and reflect about lessons learned in order to refine visualization design guidelines. We characterize two axes - a task clarity axis from fuzzy to crisp and an information location axis from the domain expert's head to the computer - and use these axes to reason about design study contributions, their suitability, and uniqueness from other approaches. The proposed methodological framework consists of 9 stages: learn, winnow, cast, discover, design, implement, deploy, reflect, and write. For each stage we provide practical guidance and outline potential pitfalls. We also conducted an extensive literature survey of related methodological approaches that involve a significant amount of qualitative field work, and compare design study methodology to that of ethnography, grounded theory, and action research.",
      "The considerable previous work characterizing visualization usage has focused on low-level tasks or interactions and high-level tasks, leaving a gap between them that is not addressed. This gap leads to a lack of distinction between the ends and means of a task, limiting the potential for rigorous analysis. We contribute a multi-level typology of visualization tasks to address this gap, distinguishing why and how a visualization task is performed, as well as what the task inputs and outputs are. Our typology allows complex tasks to be expressed as sequences of interdependent simpler tasks, resulting in concise and flexible descriptions for tasks of varying complexity and scope. It provides abstract rather than domain-specific descriptions of tasks, so that useful comparisons can be made between visualization systems targeted at different application domains. This descriptive power supports a level of analysis required for the generation of new designs, by guiding the translation of domain-specific problems into abstract tasks, and for the qualitative evaluation of visualization usage. We demonstrate the benefits of our approach in a detailed case study, comparing task descriptions from our typology to those derived from related work. We also discuss the similarities and differences between our typology and over two dozen extant classification systems and theoretical frameworks from the literatures of visualization, human-computer interaction, information retrieval, communications, and cartography.",
      "We describe the design and deployment of Many Eyes, a public Web site where users may upload data, create interactive visualizations, and carry on discussions. The goal of the site is to support collaboration around visualizations at a large scale by fostering a social style of data analysis in which visualizations not only serve as a discovery tool for individuals but also as a medium to spur discussion among users. To support this goal, the site includes novel mechanisms for end-user creation of visualizations and asynchronous collaboration around those visualizations. In addition to describing these technologies, we provide a preliminary report on the activity of our users."
    ],
    "unique_value_count": 3807,
    "top_frequencies": {
      "": 70,
      "The investigation of the VAST Contest collection provided a valuable test for text mining techniques. Our group has focused on creating analytical tools to unveil relevant patterns and to aid with the content navigation in such text collections. Our results show how such an approach, in combination with visualization techniques, can ease the discovery process especially when multiple tools founded on the same approach to data mining are used in complement to and in concert with one another.": 2,
      "Data-Driven Documents (D3) is a novel representation-transparent approach to visualization for the web. Rather than hide the underlying scenegraph within a toolkit-specific abstraction, D3 enables direct inspection and manipulation of a native representation: the standard document object model (DOM). With D3, designers selectively bind input data to arbitrary document elements, applying dynamic transforms to both generate and modify content. We show how representational transparency improves expressiveness and better integrates with developer tools than prior approaches, while offering comparable notational efficiency and retaining powerful declarative components. Immediate evaluation of operators further simplifies debugging and allows iterative development. Additionally, we demonstrate how D3 transforms naturally enable animation and interaction with dramatic performance improvements over intermediate representations.": 1,
      "Understanding relationships between sets is an important analysis task that has received widespread attention in the visualization community. The major challenge in this context is the combinatorial explosion of the number of set intersections if the number of sets exceeds a trivial threshold. In this paper we introduce UpSet, a novel visualization technique for the quantitative analysis of sets, their intersections, and aggregates of intersections. UpSet is focused on creating task-driven aggregates, communicating the size and properties of aggregates and intersections, and a duality between the visualization of the elements in a dataset and their set membership. UpSet visualizes set intersections in a matrix layout and introduces aggregates based on groupings and queries. The matrix layout enables the effective representation of associated data, such as the number of elements in the aggregates and intersections, as well as additional summary statistics derived from subset or element attributes. Sorting according to various measures enables a task-driven analysis of relevant intersections and aggregates. The elements represented in the sets and their associated attributes are visualized in a separate view. Queries based on containment in specific intersections, aggregates or driven by attribute filters are propagated between both views. We also introduce several advanced visual encodings and interaction methods to overcome the problems of varying scales and to address scalability. UpSet is web-based and open source. We demonstrate its general utility in multiple use cases from various domains.": 1,
      "Data visualization is regularly promoted for its ability to reveal stories within data, yet these “data stories” differ in important ways from traditional forms of storytelling. Storytellers, especially online journalists, have increasingly been integrating visualizations into their narratives, in some cases allowing the visualization to function in place of a written story. In this paper, we systematically review the design space of this emerging class of visualizations. Drawing on case studies from news media to visualization research, we identify distinct genres of narrative visualization. We characterize these design differences, together with interactivity and messaging, in terms of the balance between the narrative flow intended by the author (imposed by graphical elements and the interface) and story discovery on the part of the reader (often through interactive exploration). Our framework suggests design strategies for narrative visualization, including promising under-explored approaches to journalistic storytelling and educational media.": 1
    }
  },
  "AuthorNames-Deduped": {
    "column_name": "AuthorNames-Deduped",
    "examples": [
      "Michael Bostock;Vadim Ogievetsky;Jeffrey Heer",
      "Alexander Lex;Nils Gehlenborg;Hendrik Strobelt;Romain Vuillemot;Hanspeter Pfister",
      "Edward Segel;Jeffrey Heer",
      "Danny Holten",
      "Ji Soo Yi;Youn ah Kang;John T. Stasko;Julie A. Jacko",
      "Tamara Munzner",
      "Arvind Satyanarayan;Dominik Moritz;Kanit Wongsuphasawat;Jeffrey Heer",
      "Michael Sedlmair;Miriah D. Meyer;Tamara Munzner",
      "Matthew Brehmer;Tamara Munzner",
      "Fernanda B. Viégas;Martin Wattenberg;Frank van Ham;Jesse Kriss;Matthew M. McKeon"
    ],
    "unique_value_count": 3720,
    "top_frequencies": {
      "Lloyd Treinish": 6,
      "Chris E. Weaver": 5,
      "Jarke J. van Wijk": 5,
      "Wim C. de Leeuw;Robert van Liere": 4,
      "Dirk J. Lehmann;Holger Theisel": 4
    }
  },
  "AuthorNames": {
    "column_name": "AuthorNames",
    "examples": [
      "Michael Bostock;Vadim Ogievetsky;Jeffrey Heer",
      "Alexander Lex;Nils Gehlenborg;Hendrik Strobelt;Romain Vuillemot;Hanspeter Pfister",
      "Edward Segel;Jeffrey Heer",
      "Danny Holten",
      "Ji Soo Yi;Youn ah Kang;John Stasko",
      "Tamara Munzner",
      "Arvind Satyanarayan;Dominik Moritz;Kanit Wongsuphasawat;Jeffrey Heer",
      "Michael Sedlmair;Miriah Meyer;Tamara Munzner",
      "Matthew Brehmer;Tamara Munzner",
      "Fernanda B. Viegas;Martin Wattenberg;Frank van Ham;Jesse Kriss;Matt McKeon"
    ],
    "unique_value_count": 3740,
    "top_frequencies": {
      "L.A. Treinish": 6,
      "J.J. van Wijk": 4,
      "Dirk J. Lehmann;Holger Theisel": 4,
      "Pak Chung Wong;R.D. Bergeron": 4,
      "Tobias Günther;Holger Theisel": 4
    }
  },
  "AuthorAffiliation": {
    "column_name": "AuthorAffiliation",
    "examples": [
      "Computer Science Department, Stanford University, Stanford, CA, USA;Computer Science Department, Stanford University, Stanford, CA, USA;Computer Science Department, Stanford University, Stanford, CA, USA",
      "Hendrik Strobelt and Hanspeter Pfister are with Harvard University.;Harvard Medical School;Hendrik Strobelt and Hanspeter Pfister are with Harvard University.;Romain Vuillemot is with Harvard University;Hendrik Strobelt and Hanspeter Pfister are with Harvard University.",
      "University of Stanford, Stanford, CA, USA;University of Stanford, Stanford, CA, USA",
      "Technische Universiteit Eindhoven, Netherlands",
      "Health Systems Institute, Georgia Institute of Technology, USA;School of Interactive Computing & GVU Center, Georgia Institute of Technology, USA;School of Interactive Computing & GVU Center, Georgia Institute of Technology, USA;School of Interactive Computing & GVU Center, Georgia Institute of Technology, USA and The Wallace H. Coulter Department of Biomedical Engineering, Emory University",
      "University of British Columbia, Canada",
      "Stanford University;University of Washington;University of Washington;University of Washington",
      "University of British, Colombia;University of Utah, USA;University of British, Colombia",
      "University of British Columbia, Canada;University of British Columbia, Canada",
      "IBM Research GmbH, Switzerland;IBM Research GmbH, Switzerland;IBM Research GmbH, Switzerland;IBM Research GmbH, Switzerland;IBM Research GmbH, Switzerland"
    ],
    "unique_value_count": 3635,
    "top_frequencies": {
      "IBM Thomas J. Watson Research Center, Yorktown Heights, NY, USA": 8,
      "University of California, Davis, USA;University of California, Davis, USA": 7,
      "Department of Computer Science, Indiana University, Bloomington, IN, USA;Department of Computer Science, Indiana University, Bloomington, IN, USA": 6,
      "University of California, Davis, USA;University of California, Davis, USA;University of California, Davis, USA": 6,
      "Computer Science Department, University of California, Santa Cruz, CA, USA;Computer Science Department, University of California, Santa Cruz, CA, USA": 6
    }
  },
  "InternalReferences": {
    "column_name": "InternalReferences",
    "examples": [
      "10.1109/infvis.2000.885091;10.1109/infvis.2000.885098;10.1109/tvcg.2010.144;10.1109/tvcg.2009.174;10.1109/infvis.2004.12;10.1109/tvcg.2006.178;10.1109/infvis.2005.1532122;10.1109/tvcg.2008.166;10.1109/infvis.2004.64;10.1109/tvcg.2007.70539;10.1109/infvis.2000.885091",
      "10.1109/tvcg.2008.144;10.1109/tvcg.2013.184;10.1109/tvcg.2011.186;10.1109/tvcg.2010.210;10.1109/tvcg.2009.122;10.1109/tvcg.2011.185;10.1109/tvcg.2011.183;10.1109/tvcg.2008.144",
      "10.1109/tvcg.2007.70577;10.1109/tvcg.2007.70539;10.1109/tvcg.2008.137;10.1109/vast.2007.4388992;10.1109/tvcg.2007.70577",
      "10.1109/infvis.2004.1;10.1109/infvis.2003.1249008;10.1109/infvis.2005.1532150;10.1109/infvis.2003.1249030;10.1109/infvis.2005.1532129;10.1109/infvis.1997.636718;10.1109/infvis.2002.1173152;10.1109/infvis.2004.1",
      "10.1109/visual.1994.346302;10.1109/infvis.2005.1532136;10.1109/infvis.1996.559213;10.1109/visual.1991.175794;10.1109/infvis.2005.1532126;10.1109/infvis.2000.885091;10.1109/infvis.1999.801860;10.1109/infvis.2000.885086;10.1109/visual.1994.346302",
      "10.1109/vast.2007.4389008;10.1109/infvis.2005.1532136;10.1109/tvcg.2008.117;10.1109/tvcg.2006.160;10.1109/visual.1998.745289;10.1109/tvcg.2007.70515;10.1109/tvcg.2008.109;10.1109/visual.1992.235203;10.1109/infvis.2004.59;10.1109/infvis.2005.1532124;10.1109/infvis.1998.729560;10.1109/infvis.2004.10;10.1109/tvcg.2008.125;10.1109/infvis.1997.636792;10.1109/infvis.2005.1532150;10.1109/visual.1990.146375;10.1109/vast.2007.4389008",
      "10.1109/tvcg.2015.2467091;10.1109/tvcg.2009.174;10.1109/tvcg.2015.2467191;10.1109/tvcg.2014.2346260;10.1109/infvis.2000.885086;10.1109/tvcg.2007.70515;10.1109/tvcg.2011.185;10.1109/tvcg.2015.2467091",
      "10.1109/infvis.1999.801869;10.1109/infvis.1996.559226;10.1109/tvcg.2008.117;10.1109/tvcg.2009.152;10.1109/tvcg.2010.206;10.1109/infvis.2005.1532136;10.1109/tvcg.2010.193;10.1109/vast.2011.6102443;10.1109/tvcg.2011.174;10.1109/vast.2007.4389008;10.1109/tvcg.2009.116;10.1109/tvcg.2011.192;10.1109/tvcg.2009.128;10.1109/infvis.2003.1249023;10.1109/tvcg.2009.167;10.1109/tvcg.2009.111;10.1109/tvcg.2011.209;10.1109/tvcg.2010.137;10.1109/infvis.1999.801869",
      "10.1109/tvcg.2007.70541;10.1109/tvcg.2012.219;10.1109/infvis.1996.559213;10.1109/tvcg.2012.213;10.1109/tvcg.2012.273;10.1109/infvis.2005.1532136;10.1109/tvcg.2010.177;10.1109/tvcg.2007.70539;10.1109/infvis.2002.1173148;10.1109/tvcg.2007.70515;10.1109/tvcg.2012.204;10.1109/tvcg.2009.111;10.1109/tvcg.2008.109;10.1109/visual.1992.235203;10.1109/infvis.2004.59;10.1109/vast.2008.4677365;10.1109/vast.2011.6102438;10.1109/tvcg.2008.121;10.1109/tvcg.2008.137;10.1109/infvis.1998.729560;10.1109/infvis.2004.10;10.1109/tvcg.2012.252;10.1109/visual.1990.146375;10.1109/tvcg.2007.70541",
      "10.1109/infvis.2005.1532122;10.1109/visual.1991.175820;10.1109/infvis.2003.1249007;10.1109/infvis.2004.13"
    ],
    "unique_value_count": 3181,
    "top_frequencies": {
      "": 629,
      "10.1109/visual.1991.175782;10.1109/visual.1991.175782": 5,
      "10.1109/visual.1991.175773;10.1109/visual.1991.175773": 4,
      "10.1109/visual.1991.175771;10.1109/visual.1991.175771": 4,
      "10.1109/visual.1992.235219;10.1109/visual.1992.235219": 4
    }
  },
  "AuthorKeywords": {
    "column_name": "AuthorKeywords",
    "examples": [
      "Information visualization, user interfaces, toolkits, 2D graphics",
      "Sets, set visualization, sets intersections, set attributes, set relationships, multidimensional data",
      "Narrative visualization, storytelling, design methods, case study, journalism, social data analysis",
      "Network visualization, edge bundling, edge aggregation, edge concentration, curves, graph visualization, tree visualization, node-link diagrams, hierarchies, treemaps",
      "Information visualization, interaction, interaction techniques, taxonomy, visual analytics",
      "Models, frameworks, design, evaluation",
      "Information visualization;interaction;systems;toolkits;declarative specification",
      "Design study, methodology, visualization, framework",
      "Typology, visualization models, task and requirements analysis, qualitative evaluation",
      "Visualization, World Wide Web, Social Software, Social Data Analysis, Communication-Minded Visualization"
    ],
    "unique_value_count": 2883,
    "top_frequencies": {
      "": 979,
      "Information visualization, user interfaces, toolkits, 2D graphics": 2,
      "Movement data, spatio-temporal data, aggregation, scalable visualization, geovisualization": 2,
      "Text visualization, topic modeling": 2,
      "computed tomography angiography, vessel analysis, curved planar reformation": 2
    }
  },
  "AminerCitationCount": {
    "column_name": "AminerCitationCount",
    "examples": [
      "3795",
      "1243",
      "1408",
      "1395",
      "1149",
      "1035",
      "641",
      "828",
      "696",
      "1011"
    ],
    "unique_value_count": 397,
    "top_frequencies": {
      "": 433,
      "0": 86,
      "1": 85,
      "3": 73,
      "2": 67
    }
  },
  "CitationCount_CrossRef": {
    "column_name": "CitationCount_CrossRef",
    "examples": [
      "2178",
      "1561",
      "726",
      "679",
      "674",
      "592",
      "519",
      "513",
      "509",
      "468"
    ],
    "unique_value_count": 229,
    "top_frequencies": {
      "0": 364,
      "2": 186,
      "1": 183,
      "3": 147,
      "4": 122
    }
  },
  "PubsCited_CrossRef": {
    "column_name": "PubsCited_CrossRef",
    "examples": [
      "41",
      "29",
      "27",
      "33",
      "56",
      "53",
      "31",
      "95",
      "84",
      "30"
    ],
    "unique_value_count": 120,
    "top_frequencies": {
      "0": 92,
      "17": 85,
      "23": 78,
      "35": 76,
      "27": 72
    }
  },
  "Downloads_Xplore": {
    "column_name": "Downloads_Xplore",
    "examples": [
      "11668",
      "26170",
      "31097",
      "7861",
      "12777",
      "10257",
      "7008",
      "11892",
      "10497",
      "3676"
    ],
    "unique_value_count": 1679,
    "top_frequencies": {
      "71": 17,
      "59": 14,
      "76": 14,
      "57": 14,
      "108": 13
    }
  },
  "Award": {
    "column_name": "Award",
    "examples": [
      "TT",
      "TT;BP",
      "",
      "BP",
      "HM",
      "BA",
      "BCS"
    ],
    "unique_value_count": 7,
    "top_frequencies": {
      "": 3604,
      "HM": 144,
      "BP": 78,
      "TT": 35,
      "BA": 6
    }
  },
  "GraphicsReplicabilityStamp": {
    "column_name": "GraphicsReplicabilityStamp",
    "examples": [
      "",
      "X"
    ],
    "unique_value_count": 2,
    "top_frequencies": {
      "": 3850,
      "X": 27
    }
  }
}