{
  "Conference": {
    "queries": {
      "How does the distribution of papers across conferences reveal research focus?": "Interactive radial bar chart with hover animations and categorical color encoding",
      "Which conferences have the most diverse range of paper types?": "Layered bar chart with gradient fills and interactive legend filtering",
      "What is the comparative impact of conferences on research trends?": "Bubble chart with size and color encoding to represent paper count and impact",
      "How do conference participation trends change over time?": "Faceted small multiples with brushing and linking to show temporal changes",
      "What insights can be drawn from the conference participation landscape?": "Arc chart with polar coordinates and sequential color schemes"
    }
  },
  "Year": {
    "queries": {
      "How have publication trends evolved over the years?": "Streamgraph with flowing, organic area fills to show publication volume",
      "What are the key temporal patterns in research output?": "Interactive time series with brush selection and zooming for detailed exploration",
      "How do publication peaks and troughs correlate with major events?": "Multi-layer chart combining line trends with annotations for context",
      "What are the long-term trends in research focus over decades?": "Connected scatterplot showing correlation evolution over time",
      "How does the yearly publication count reflect research dynamics?": "Heatmap with sequential color schemes and interactive tooltips"
    }
  },
  "PaperType": {
    "queries": {
      "What is the distribution of paper types across different conferences?": "Interactive radial bar chart with hover animations and value annotations",
      "How do different paper types contribute to research diversity?": "Bubble chart with categorical color encoding and size variations",
      "What are the trends in paper type submissions over time?": "Streamgraph with flowing area fills to show temporal changes",
      "How do paper types correlate with citation impact?": "Scatterplot matrix with cross-filtering and highlighting",
      "What insights can be drawn from the distribution of paper types?": "Layered bar chart with gradient fills and interactive legend filtering"
    }
  },
  "PageCount": {
    "queries": {
      "How does the distribution of paper lengths vary across conferences?": "Box plot with overlaid strip plot for detailed distribution analysis",
      "What are the trends in paper length over time?": "Interactive time series with brush selection and zooming for detailed exploration",
      "How do paper lengths correlate with citation impact?": "Bubble chart with size and color encoding to represent length and impact",
      "What insights can be drawn from the distribution of paper lengths?": "Histogram with interactive tooltips and dynamic binning",
      "How do paper lengths vary by paper type?": "Faceted small multiples with brushing and linking to show categorical differences"
    }
  },
  "TotalCitations": {
    "queries": {
      "What is the distribution of total citations across different conferences?": "Interactive radial bar chart with hover animations and value annotations",
      "How do citation patterns reveal research impact over time?": "Streamgraph with flowing area fills to show temporal changes",
      "What are the trends in citation impact across paper types?": "Bubble chart with size and color encoding to represent impact and type",
      "How do total citations correlate with paper length?": "Scatterplot matrix with cross-filtering and highlighting",
      "What insights can be drawn from the distribution of total citations?": "Histogram with interactive tooltips and dynamic binning"
    }
  },
  "Year & Conference": {
    "queries": {
      "How do publication trends vary across conferences over time?": "Streamgraph with flowing area fills and temporal animation",
      "What are the temporal patterns in conference participation?": "Connected scatterplot showing temporal correlation patterns",
      "How do conferences contribute to research trends over decades?": "Multi-layer chart combining line trends with confidence intervals",
      "What insights can be drawn from the temporal distribution of conferences?": "Interactive time series with brush selection and dynamic zooming",
      "How do conference trends reflect shifts in research focus?": "Heatmap with sequential color schemes and rich hover tooltips"
    }
  },
  "Year & PaperType": {
    "queries": {
      "How have paper type trends evolved over the years?": "Streamgraph with flowing area fills and temporal animation",
      "What are the key temporal patterns in paper type submissions?": "Connected scatterplot showing temporal correlation patterns",
      "How do paper types contribute to research trends over decades?": "Multi-layer chart combining line trends with confidence intervals",
      "What insights can be drawn from the temporal distribution of paper types?": "Interactive time series with brush selection and dynamic zooming",
      "How do paper type trends reflect shifts in research focus?": "Heatmap with sequential color schemes and rich hover tooltips"
    }
  },
  "Year & TotalCitations": {
    "queries": {
      "How do citation patterns reveal research impact evolution over time?": "3D bubble chart with temporal and impact encoding",
      "What are the trends in citation impact across different years?": "Slope graph showing changes between time periods with impact indicators",
      "How do high-impact papers cluster across time and citation dimensions?": "Hexbin plot with aggregated hover details and density encoding",
      "What insights can be drawn from the temporal distribution of citations?": "Interactive time series with brush selection and dynamic zooming",
      "How do citation trends reflect shifts in research focus?": "Heatmap with sequential color schemes and rich hover tooltips"
    }
  },
  "Conference & PaperType": {
    "queries": {
      "How do paper types vary across different conferences?": "Faceted small multiples with brushing and linking to show categorical differences",
      "What are the trends in paper type submissions across conferences?": "Bubble chart with size and color encoding to represent type and conference",
      "How do conferences contribute to the diversity of paper types?": "Layered bar chart with gradient fills and interactive legend filtering",
      "What insights can be drawn from the distribution of paper types by conference?": "Arc chart with polar coordinates and sequential color schemes",
      "How do paper type trends reflect shifts in conference focus?": "Heatmap with sequential color schemes and rich hover tooltips"
    }
  },
  "attributes": [
    "Conference",
    "Year",
    "PaperType",
    "PageCount",
    "TotalCitations",
    "Year & Conference",
    "Year & PaperType",
    "Year & TotalCitations",
    "Conference & PaperType"
  ]
}