{
  "Conference": {
    "queries": {
      "What is the distribution of papers by conference type?": "Bar chart or pie chart",
      "Which conference has the highest number of published papers?": "Bar chart",
      "How many papers were submitted for each conference?": "Bar chart",
      "What proportion of the total publications does each conference contribute?": "Pie chart",
      "Compare the number of papers across different conference types.": "Stacked bar chart"
    }
  },
  "Year": {
    "queries": {
      "How has the number of publications changed over the years?": "Line chart",
      "What is the trend of publications over the years?": "Line chart or area chart",
      "Which year had the highest number of publications?": "Bar chart",
      "Compare the number of publications in the first and last five years.": "Grouped bar chart",
      "What is the cumulative number of publications over time?": "Area chart"
    }
  },
  "PaperType": {
    "queries": {
      "What is the distribution of paper types?": "Bar chart or pie chart",
      "Which paper type is most common?": "Bar chart",
      "How do the counts of different paper types compare?": "Stacked bar chart",
      "What proportion of papers are of each type?": "Pie chart",
      "Compare the number of papers across different paper types.": "Grouped bar chart"
    }
  },
  "CitationImpact": {
    "queries": {
      "What is the distribution of papers by citation impact category?": "Bar chart",
      "Which citation impact category is most common?": "Pie chart",
      "How do the counts of different citation impact categories compare?": "Stacked bar chart",
      "What proportion of papers fall into each citation impact category?": "Pie chart",
      "Compare the number of papers across different citation impact categories.": "Grouped bar chart"
    }
  },
  "AuthorCountry": {
    "queries": {
      "What is the geographic distribution of authors by country?": "Geographic distribution map",
      "Which country has the highest number of authors?": "Bar chart",
      "How do the counts of authors from different countries compare?": "Stacked bar chart",
      "What proportion of authors are from each country?": "Pie chart",
      "Compare the number of authors across different countries.": "Grouped bar chart"
    }
  },
  "PageCount": {
    "queries": {
      "What is the distribution of paper lengths?": "Histogram",
      "Which paper length is most common?": "Bar chart",
      "How do the counts of different paper lengths compare?": "Box plot",
      "What proportion of papers fall into each length category?": "Pie chart",
      "Compare the number of papers across different length categories.": "Grouped bar chart"
    }
  },
  "Year & Conference": {
    "queries": {
      "How has the number of publications changed over the years for each conference?": "Stacked line chart",
      "Which conference had the most publications each year?": "Stacked bar chart",
      "Compare the publication trends over time across different conferences.": "Multi-line chart",
      "What is the trend of publications for each conference over the years?": "Line chart",
      "How do the publication counts compare across conferences each year?": "Grouped bar chart"
    }
  },
  "Year & PaperType": {
    "queries": {
      "How has the distribution of paper types changed over the years?": "Stacked area chart",
      "Which type of paper was most commonly submitted each year?": "Line chart or stacked bar chart",
      "Rank the paper types by submission count per year.": "Grouped bar chart",
      "How many journal papers were submitted each year?": "Line chart",
      "Compare yearly trends across all paper types.": "Multi-line chart"
    }
  },
  "Year & CitationImpact": {
    "queries": {
      "How has the distribution of citation impact categories changed over the years?": "Stacked area chart",
      "Which citation impact category was most common each year?": "Line chart or stacked bar chart",
      "Rank the citation impact categories by count per year.": "Grouped bar chart",
      "How many papers with high impact were published each year?": "Line chart",
      "Compare yearly trends across all citation impact categories.": "Multi-line chart"
    }
  },
  "Conference & PaperType": {
    "queries": {
      "What is the distribution of paper types within each conference?": "Stacked bar chart",
      "Which paper type is most common in each conference?": "Grouped bar chart",
      "Compare the distribution of paper types across different conferences.": "Stacked bar chart",
      "How do the counts of paper types compare within each conference?": "Grouped bar chart",
      "What proportion of each conference's papers are of each type?": "Pie chart"
    }
  },
  "Conference & CitationImpact": {
    "queries": {
      "What is the distribution of citation impact categories within each conference?": "Stacked bar chart",
      "Which citation impact category is most common in each conference?": "Grouped bar chart",
      "Compare the distribution of citation impact categories across different conferences.": "Stacked bar chart",
      "How do the counts of citation impact categories compare within each conference?": "Grouped bar chart",
      "What proportion of each conference's papers fall into each citation impact category?": "Pie chart"
    }
  },
  "attributes": [
    "Conference",
    "Year",
    "PaperType",
    "CitationImpact",
    "AuthorCountry",
    "PageCount",
    "Year & Conference",
    "Year & PaperType",
    "Year & CitationImpact",
    "Conference & PaperType",
    "Conference & CitationImpact"
  ]
}