{
  "Conference": {
    "queries": {
      "What is the distribution of papers by conference type?": "Bar chart or pie chart",
      "Which conference has the highest number of published papers?": "Bar chart",
      "How many papers were submitted for each conference?": "Bar chart",
      "What proportion of the total publications does each conference contribute?": "Pie chart",
      "Compare the number of papers across different conference types.": "Stacked bar chart"
    }
  },
  "Year": {
    "queries": {
      "How has the number of publications changed over the years?": "Line chart",
      "What is the trend of publications over the years?": "Line chart or area chart",
      "Which year had the highest number of publications?": "Bar chart",
      "How does the publication count vary year by year?": "Line chart",
      "What is the cumulative number of publications over time?": "Area chart"
    }
  },
  "PaperType": {
    "queries": {
      "What is the distribution of paper types?": "Bar chart or pie chart",
      "Which paper type is most common?": "Bar chart",
      "How many papers are there of each type?": "Bar chart",
      "What proportion of papers are of each type?": "Pie chart",
      "Compare the number of papers across different paper types.": "Stacked bar chart"
    }
  },
  "TotalCitations": {
    "queries": {
      "What is the distribution of total citations?": "Histogram",
      "Which papers have the highest total citations?": "Bar chart",
      "How do citation counts vary across papers?": "Box plot",
      "What is the median citation count for papers?": "Box plot",
      "Compare citation counts across different papers.": "Box plot"
    }
  },
  "Downloads_Xplore_Binned": {
    "queries": {
      "What is the distribution of download popularity tiers?": "Bar chart or pie chart",
      "Which popularity tier has the most papers?": "Bar chart",
      "How many papers fall into each download popularity tier?": "Bar chart",
      "What proportion of papers are in each download popularity tier?": "Pie chart",
      "Compare the number of papers across different download popularity tiers.": "Stacked bar chart"
    }
  },
  "AuthorCountry": {
    "queries": {
      "What is the geographic distribution of authors?": "Geographic distribution map",
      "Which country has the most authors?": "Bar chart",
      "How many authors are there from each country?": "Bar chart",
      "What proportion of authors are from each country?": "Pie chart",
      "Compare the number of authors across different countries.": "Stacked bar chart"
    }
  },
  "Year & Conference": {
    "queries": {
      "How has the number of papers per conference changed over the years?": "Stacked line chart",
      "Which conference had the most papers each year?": "Stacked bar chart",
      "Compare the yearly trends of paper submissions across conferences.": "Multi-line chart",
      "What is the trend of conference participation over time?": "Line chart",
      "How does the number of papers per conference vary by year?": "Stacked area chart"
    }
  },
  "Year & PaperType": {
    "queries": {
      "How has the distribution of paper types changed over the years?": "Stacked area chart",
      "Which type of paper was most commonly submitted each year?": "Line chart or stacked bar chart",
      "Rank the paper types by submission count per year.": "Grouped bar chart",
      "How many journal papers were submitted each year?": "Line chart",
      "Compare yearly trends across all paper types.": "Multi-line chart"
    }
  },
  "Conference & PaperType": {
    "queries": {
      "What is the distribution of paper types within each conference?": "Stacked bar chart",
      "Which conference has the most journal papers?": "Bar chart",
      "How do paper types vary across different conferences?": "Stacked bar chart",
      "Compare the number of each paper type across conferences.": "Grouped bar chart",
      "What proportion of each paper type is present in each conference?": "Stacked bar chart"
    }
  },
  "Year & TotalCitations": {
    "queries": {
      "How have citation counts changed over the years?": "Line chart",
      "Which year had the highest average citation count?": "Bar chart",
      "What is the trend of total citations over time?": "Line chart",
      "Compare citation counts across different years.": "Box plot",
      "How does the median citation count vary by year?": "Line chart"
    }
  },
  "Conference & TotalCitations": {
    "queries": {
      "What is the distribution of total citations by conference?": "Box plot",
      "Which conference has the highest median citation count?": "Bar chart",
      "How do citation counts vary across conferences?": "Box plot",
      "Compare the total citations across different conferences.": "Box plot",
      "What is the average citation count for each conference?": "Bar chart"
    }
  },
  "PaperType & TotalCitations": {
    "queries": {
      "What is the distribution of total citations by paper type?": "Box plot",
      "Which paper type has the highest median citation count?": "Bar chart",
      "How do citation counts vary across paper types?": "Box plot",
      "Compare the total citations across different paper types.": "Box plot",
      "What is the average citation count for each paper type?": "Bar chart"
    }
  },
  "Downloads_Xplore_Binned & TotalCitations": {
    "queries": {
      "What is the relationship between download popularity and total citations?": "Box plot",
      "Which download popularity tier has the highest median citation count?": "Bar chart",
      "How do citation counts vary across download popularity tiers?": "Box plot",
      "Compare the total citations across different download popularity tiers.": "Box plot",
      "What is the average citation count for each download popularity tier?": "Bar chart"
    }
  },
  "AuthorCountry & TotalCitations": {
    "queries": {
      "What is the distribution of total citations by author country?": "Box plot",
      "Which country has the highest median citation count?": "Bar chart",
      "How do citation counts vary across countries?": "Box plot",
      "Compare the total citations across different countries.": "Box plot",
      "What is the average citation count for each country?": "Bar chart"
    }
  },
  "attributes": [
    "Conference",
    "Year",
    "PaperType",
    "TotalCitations",
    "Downloads_Xplore_Binned",
    "AuthorCountry",
    "Year & Conference",
    "Year & PaperType",
    "Conference & PaperType",
    "Year & TotalCitations",
    "Conference & TotalCitations",
    "PaperType & TotalCitations",
    "Downloads_Xplore_Binned & TotalCitations",
    "AuthorCountry & TotalCitations"
  ]
}