{
  "Conference": {
    "queries": {
      "What is the distribution of papers by conference type?": "Bar chart or pie chart",
      "Which conference has the highest number of published papers?": "Bar chart",
      "How many papers were submitted for each conference?": "Bar chart",
      "What proportion of the total publications does each conference contribute?": "Pie chart",
      "Compare the number of papers across different conference types.": "Stacked bar chart"
    }
  },
  "Year": {
    "queries": {
      "How has the number of publications changed over the years?": "Line chart",
      "What is the trend of publications over time?": "Area chart",
      "Which year had the highest number of publications?": "Bar chart",
      "How do publication counts vary by year?": "Line chart",
      "What is the distribution of publications across different years?": "Histogram"
    }
  },
  "PaperType": {
    "queries": {
      "What is the distribution of papers by type?": "Bar chart or pie chart",
      "Which paper type is most common?": "Bar chart",
      "How many papers of each type were published?": "Bar chart",
      "What proportion of the total publications does each paper type contribute?": "Pie chart",
      "Compare the number of papers across different paper types.": "Stacked bar chart"
    }
  },
  "Award": {
    "queries": {
      "What is the distribution of awards among papers?": "Bar chart or pie chart",
      "Which award is most frequently given?": "Bar chart",
      "How many papers received each type of award?": "Bar chart",
      "What proportion of papers received awards?": "Pie chart",
      "Compare the number of awards across different types.": "Stacked bar chart"
    }
  },
  "Year & Conference": {
    "queries": {
      "How has the number of papers published in each conference changed over the years?": "Stacked line chart",
      "Which conference had the most papers published each year?": "Stacked bar chart",
      "Compare the trends of publications across conferences over time.": "Multi-line chart",
      "What is the yearly distribution of papers for each conference?": "Grouped bar chart",
      "How do publication trends differ between conferences over the years?": "Stacked area chart"
    }
  },
  "Year & PaperType": {
    "queries": {
      "How has the distribution of paper types changed over the years?": "Stacked area chart",
      "Which type of paper was most commonly submitted each year?": "Line chart or stacked bar chart",
      "Rank the paper types by submission count per year.": "Grouped bar chart",
      "How many journal papers were submitted each year?": "Line chart",
      "Compare yearly trends across all paper types.": "Multi-line chart"
    }
  },
  "Conference & PaperType": {
    "queries": {
      "What is the distribution of paper types within each conference?": "Stacked bar chart",
      "Which paper type is most common in each conference?": "Grouped bar chart",
      "How do paper types vary across different conferences?": "Stacked bar chart",
      "Compare the number of each paper type across conferences.": "Grouped bar chart",
      "What proportion of each conference's papers are of each type?": "Stacked bar chart"
    }
  },
  "Year & Award": {
    "queries": {
      "How has the distribution of awards changed over the years?": "Stacked area chart",
      "Which year had the highest number of awarded papers?": "Bar chart",
      "Compare the number of awards given each year.": "Line chart",
      "What is the trend of award distribution over time?": "Line chart",
      "How do award trends vary by year?": "Stacked bar chart"
    }
  },
  "Conference & Award": {
    "queries": {
      "What is the distribution of awards across different conferences?": "Stacked bar chart",
      "Which conference has the highest number of awarded papers?": "Bar chart",
      "How do awards vary across different conferences?": "Stacked bar chart",
      "Compare the number of awards given in each conference.": "Grouped bar chart",
      "What proportion of each conference's papers received awards?": "Stacked bar chart"
    }
  },
  "PaperType & Award": {
    "queries": {
      "What is the distribution of awards across different paper types?": "Stacked bar chart",
      "Which paper type receives the most awards?": "Bar chart",
      "How do awards vary across different paper types?": "Stacked bar chart",
      "Compare the number of awards given for each paper type.": "Grouped bar chart",
      "What proportion of each paper type received awards?": "Stacked bar chart"
    }
  },
  "attributes": [
    "Conference",
    "Year",
    "PaperType",
    "Award",
    "Year & Conference",
    "Year & PaperType",
    "Conference & PaperType",
    "Year & Award",
    "Conference & Award",
    "PaperType & Award"
  ]
}