{
  "selected_queries": [
    {
      "order": 1,
      "query": "Distribution of papers by conference",
      "chart_type": "Bar Chart",
      "source_attribute": "Conference",
      "flow_stage": "Introduction & Overview",
      "rationale": "This query provides a high-level overview of the dataset by showing how papers are distributed across different conferences, setting the stage for deeper analysis."
    },
    {
      "order": 2,
      "query": "Paper types distribution",
      "chart_type": "Pie Chart",
      "source_attribute": "PaperType",
      "flow_stage": "Introduction & Overview",
      "rationale": "This query complements the conference distribution by showing the proportion of different paper types, providing a foundational understanding of the dataset's composition."
    },
    {
      "order": 3,
      "query": "Distribution of awards by conference",
      "chart_type": "Bar Chart",
      "source_attribute": "Conference & Award",
      "flow_stage": "Distribution Analysis",
      "rationale": "This query explores how awards are distributed across conferences, highlighting any concentrations or patterns in award distribution."
    },
    {
      "order": 4,
      "query": "Yearly distribution of paper types",
      "chart_type": "Line Chart",
      "source_attribute": "Year & PaperType",
      "flow_stage": "Temporal Trends",
      "rationale": "This query examines how the distribution of paper types has changed over time, identifying trends and shifts in research focus."
    },
    {
      "order": 5,
      "query": "Trends in conference participation over the years",
      "chart_type": "Line Chart",
      "source_attribute": "Year & Conference",
      "flow_stage": "Temporal Trends",
      "rationale": "This query analyzes participation trends in conferences over the years, providing insights into the growth or decline of conference popularity."
    },
    {
      "order": 6,
      "query": "Correlation between paper types and awards",
      "chart_type": "Scatter Plot",
      "source_attribute": "PaperType & Award",
      "flow_stage": "Relationship Analysis",
      "rationale": "This query investigates the relationship between paper types and the likelihood of receiving awards, uncovering potential biases or trends."
    },
    {
      "order": 7,
      "query": "Impact of conference on award distribution over time",
      "chart_type": "Combination Chart",
      "source_attribute": "Year & Conference & Award",
      "flow_stage": "Advanced Insights & Conclusions",
      "rationale": "This query synthesizes previous insights by examining how the impact of conferences on award distribution has evolved over time, leading to actionable conclusions."
    }
  ],
  "logical_flow": "The narrative begins with an overview of the dataset, focusing on the distribution of papers by conference and paper type. It then delves into the distribution of awards across conferences, followed by an analysis of temporal trends in paper types and conference participation. The story progresses to explore relationships between paper types and awards, culminating in a comprehensive analysis of the impact of conferences on award distribution over time.",
  "flow_justification": "This order creates a compelling story by starting with broad insights and gradually narrowing down to specific relationships and trends. Each query builds on the previous one, ensuring a logical progression from introduction to conclusion, while maintaining diversity in chart types and analytical approaches."
}