{
  "selected_queries": [
    {
      "order": 1,
      "query": "Distribution of papers by conference",
      "chart_type": "Bar Chart",
      "source_attribute": "Conference",
      "flow_stage": "Introduction & Overview",
      "rationale": "Provides a high-level overview of the dataset by showing the number of papers per conference, setting the stage for deeper analysis."
    },
    {
      "order": 2,
      "query": "Paper types distribution",
      "chart_type": "Pie Chart",
      "source_attribute": "PaperType",
      "flow_stage": "Introduction & Overview",
      "rationale": "Offers insight into the composition of paper types, helping to understand the dataset's structure."
    },
    {
      "order": 3,
      "query": "Distribution of awards by conference",
      "chart_type": "Bar Chart",
      "source_attribute": "Conference & Award",
      "flow_stage": "Distribution Analysis",
      "rationale": "Explores how awards are distributed across different conferences, highlighting any concentration of awards."
    },
    {
      "order": 4,
      "query": "Yearly distribution of paper types",
      "chart_type": "Stacked Bar Chart",
      "source_attribute": "Year & PaperType",
      "flow_stage": "Distribution Analysis",
      "rationale": "Analyzes the distribution of paper types over the years, identifying trends and shifts in focus."
    },
    {
      "order": 5,
      "query": "Publication trends over the years",
      "chart_type": "Line Chart",
      "source_attribute": "Year",
      "flow_stage": "Temporal Trends",
      "rationale": "Examines the overall trend in publications over time, identifying growth or decline patterns."
    },
    {
      "order": 6,
      "query": "Correlation between paper types and awards",
      "chart_type": "Scatter Plot",
      "source_attribute": "PaperType & Award",
      "flow_stage": "Relationship Analysis",
      "rationale": "Investigates the relationship between paper types and the likelihood of receiving awards, uncovering potential biases or trends."
    },
    {
      "order": 7,
      "query": "Top 10 most cited papers by category",
      "chart_type": "Bar Chart",
      "source_attribute": "PaperType",
      "flow_stage": "Advanced Insights & Conclusions",
      "rationale": "Highlights the most impactful papers, providing insights into which categories are leading in citations."
    }
  ],
  "logical_flow": "The narrative begins with an overview of the dataset, focusing on the distribution of papers by conference and paper type. It then delves into the distribution of awards across conferences and the yearly distribution of paper types, providing a deeper understanding of the dataset's structure. The analysis progresses to temporal trends, examining publication trends over the years. This is followed by a relationship analysis between paper types and awards, uncovering potential correlations. The narrative concludes with advanced insights, highlighting the top 10 most cited papers by category, offering a perspective on the dataset's impact.",
  "flow_justification": "This order creates a compelling story by starting with a broad overview, then narrowing down to specific distributions and trends, before exploring relationships and concluding with impactful insights. Each query builds on the previous one, ensuring a logical progression and comprehensive understanding of the dataset."
}